In [2]:
import pandas as pd
import nmea2position as nmea

data = nmea.read_nmea("ljic253u00.201")

In [8]:
# Select gga data
data_gga = data.loc["$GPGGA"] 
data_gga2 = data_gga[[1,2,3,4,5,9,10]] # Choose only the valid information
data_gga2.columns = ["UTC_time", "LAT", "LAT(unit)", "LON", "LON(unit)", "HEIGHT", "HEIGHT(unit)"]
# Select zda data
data_zda = data.loc["$GPZDA"] 
data_zda2 = data_zda[[1,2,3,4]]
data_zda2.columns = ["UTC_time","day","month","year"]

In [9]:
data_gga2.head(2) # Location + time

,UTC_time,LAT,LAT(unit),LON,LON(unit),HEIGHT,HEIGHT(unit)
0,,,,,,,
$GPGGA,195942.00,1157.170725,S,7652.57085,W,520.42,M
$GPGGA,195942.17,1157.170725,S,7652.57085,W,520.42,M

In [16]:
df = data_gga2.copy()
df.head(2)

,UTC_time,LAT,LAT(unit),LON,LON(unit),HEIGHT,HEIGHT(unit)
0,,,,,,,
$GPGGA,195942.00,1157.170725,S,7652.57085,W,520.42,M
$GPGGA,195942.17,1157.170725,S,7652.57085,W,520.42,M

In [21]:
df.reset_index(drop=True, inplace=True)

In [22]:
df.head(2)

    UTC_time          LAT LAT(unit)         LON LON(unit)  HEIGHT HEIGHT(unit)
0  195942.00  1157.170725         S  7652.57085         W  520.42            M
1  195942.17  1157.170725         S  7652.57085         W  520.42            M

In [50]:
def convert_decimalDegree(value):
    integer = int(value/100)
    decimal = (value - integer*100)/60
    
    final_value = integer+decimal
    
    return final_value

In [42]:
df["LAT"].apply(change_lat).round(6)

0     11.952845
1     11.952845
2     11.952845
3     11.952845
4     11.952846
5     11.952846
6     11.952846
7     11.952846
8     11.952846
9     11.952846
10    11.952846
11    11.952846
12    11.952846
13    11.952846
14    11.952846
15    11.952846
Name: LAT, dtype: float64

In [51]:
def coordinate_sign(coord):
    if coord == "S" or coord == "W":
        return -1
    elif coord == "N" or coord == "E":
        return +1
    else:
        return "Error"

In [47]:
df["LAT(unit)"].apply(lat_sign)

0    -1
1    -1
2    -1
3    -1
4    -1
5    -1
6    -1
7    -1
8    -1
9    -1
10   -1
11   -1
12   -1
13   -1
14   -1
15   -1
Name: LAT(unit), dtype: int64

In [55]:
df["Latitud"] = df["LAT"].apply(convert_decimalDegree).round(6) * df["LAT(unit)"].apply(coordinate_sign)

In [57]:
df["Longitud"] = df["LON"].apply(convert_decimalDegree).round(5) * df["LON(unit)"].apply(coordinate_sign)

In [58]:
df.head(3)

,UTC_time,LAT,LAT(unit),LON,LON(unit),HEIGHT,HEIGHT(unit),Latitud,Longitud
0,195942.00,1157.170725,S,7652.57085,W,520.42,M,-11.952845,-76.87618
1,195942.17,1157.170725,S,7652.57085,W,520.42,M,-11.952845,-76.87618
2,200042.00,1157.170727,S,7652.57085,W,520.43,M,-11.952845,-76.87618

In [59]:
df["Altura"] = df["HEIGHT"]

In [60]:
df.head(3)

,UTC_time,LAT,LAT(unit),LON,LON(unit),HEIGHT,HEIGHT(unit),Latitud,Longitud,Altura
0,195942.00,1157.170725,S,7652.57085,W,520.42,M,-11.952845,-76.87618,520.42
1,195942.17,1157.170725,S,7652.57085,W,520.42,M,-11.952845,-76.87618,520.42
2,200042.00,1157.170727,S,7652.57085,W,520.43,M,-11.952845,-76.87618,520.43

In [61]:
del df["LAT"]
del df["LAT(unit)"]
del df["LON"]
del df["LON(unit)"]
del df["HEIGHT"]
del df["HEIGHT(unit)"]

In [62]:
df.head(3)

    UTC_time    Latitud  Longitud  Altura
0  195942.00 -11.952845 -76.87618  520.42
1  195942.17 -11.952845 -76.87618  520.42
2  200042.00 -11.952845 -76.87618  520.43

In [25]:
df["LAT"].round(6).astype("str")

0     1157.170725
1     1157.170725
2     1157.170727
3     1157.170729
4      1157.17073
5     1157.170732
6     1157.170732
7     1157.170734
8     1157.170736
9     1157.170738
10     1157.17074
11     1157.17074
12    1157.170742
13    1157.170742
14    1157.170744
15    1157.170747
Name: LAT, dtype: object

In [10]:
data_zda2.head(2) # Time + date

         UTC_time  day month    year
0
$GPZDA  195942.17  9.0    09  2020.0
$GPZDA  200042.00  9.0    09  2020.0

In [11]:
 # Then, we obtain location info 
lat = data_gga2["LAT"]
lat2 = lat.values

lat_unit = data_gga2["LAT(unit)"]
lat_unit2 = lat_unit.values

lon = data_gga2["LON"]
lon2 = lon.values

lon_unit = data_gga2["LON(unit)"]
lon_unit2 = lon_unit.values

height = data_gga2["HEIGHT"]
height2 = height.values

height_unit = data_gga2["HEIGHT(unit)"]
height_unit2 = height_unit.values

latitud = []
for i in range(len(lat2)):
    dato = str(lat2[i].round(6)) # Round decimal value to 6 digits
    dato2 = dato[:2]+"\xb0"+dato[2:]+"'"+lat_unit2[i]
    latitud.append(dato2)
    
longitud = []
for i in range(len(lon2)):
    dato = str(lon2[i].round(5))
    dato2 = dato[:2]+"\xb0"+dato[2:]+"'"+lon_unit2[i]
    longitud.append(dato2)
    
altura = []
for i in range(len(height2)):
    dato = str(height2[i].round(2))+height_unit2[i]
    altura.append(dato)

In [14]:
latitud[:5]

["11°57.170725'S",
 "11°57.170725'S",
 "11°57.170727'S",
 "11°57.170729'S",
 "11°57.17073'S"]